ruby/deps/t/res/tsik_tcport/java-output/testStele_exc_out.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body Id="ID1">
  <ns3:YahooUserOnline xmlns:ns3="urn:allesta-YahooUserPing">
   <username xsi:type="xsd:string">fgx3prak</username>
  </ns3:YahooUserOnline>
 </SOAP-ENV:Body>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#xpointer(//*[@Id='ID1'])"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>6lN073ppZD89sObU2qyPP8UEo00=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>AFbxjDMQd2bd4X0IkMy4pWZrb08pcV8uuBGUmz0eV1tINped2TrelMH7hW0ZOyNS81JHwvdx
qQU44xcgrDnQVhtwhIF6kNDby0n5Fb3v0JYGUx8xZOdWLRx8fF98VvkWaXavSugzpsBlPSbo
rP4dYsAyvJZfQoR2OXalky7ojS4=</ds:SignatureValue><ds:KeyInfo><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>oqi99By1VYo0aHrkKCNT4DkIgPL/SgahbeKdGhrbu3K2XG7arfD9tqIBIKMfrX4Gp90NJa85
AV1yiNsEyvq+mUnMpNcKnLXLOjkTmMCqDYbbkehJlXPnaWLzve+mW0pJdPxtf3rbD4PS/cBQ
IvtpjmrDAU8VsZKT8DN5Kyz+EZs=</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo></ds:Signature></SOAP-ENV:Envelope>
